<section class="news">
    @forelse ($news as $item)
        <section class="itemNews">
            <div class="divNews">
                <div>
                    @if (Str::startsWith($item->image,"NEWS_"))
                        <img class="img-fluid" src="{{asset("./images/news/".$item->image)}}" alt="{{$item->title}}">
                    @else
                        <img class="img-fluid" src="{{$item->image}}" alt="{{$item->title}}">
                    @endif
                </div>
                <h1>{{$item->title}}</h1>
                <p>{{Str::limit($item->summery,500)}}</p>
                <a href="{{route('showNews',['id'=>$item->id])}}">ادامه مطالب</a>
            </div>
        </section>
    @empty
        <section class="itemNews">
            <div class="divNews">
                <h1>خبر شماره 1</h1>
                <p>
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و
                    متون
                    بلکه
                    روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با
                    هدف
                    بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و
                    متخصصان
                    را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو
                    در
                    زبان
                    فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ
                    به
                    پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی
                    اساسا
                    مورد
                    استفاده قرار گیرد.
                </p>
                <a href="#">ادامه مطالب</a>
            </div>
        </section>
        <section class="itemNews">
            <div class="divNews">
                <h1>خبر شماره 1</h1>
                <p>
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و
                    متون
                    بلکه
                    روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با
                    هدف
                    بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و
                    متخصصان
                    را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو
                    در
                    زبان
                    فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ
                    به
                    پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی
                    اساسا
                    مورد
                    استفاده قرار گیرد.
                </p>
                <a href="#">ادامه مطالب</a>
            </div>
        </section>
        <section class="itemNews">
            <div class="divNews">
                <h1>خبر شماره 1</h1>
                <p>
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و
                    متون
                    بلکه
                    روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با
                    هدف
                    بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و
                    متخصصان
                    را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو
                    در
                    زبان
                    فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ
                    به
                    پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی
                    اساسا
                    مورد
                    استفاده قرار گیرد.
                </p>
                <a href="#">ادامه مطالب</a>
            </div>
        </section>
    @endforelse
</section>
